#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.archive_file.zip_the_python_code: Reading...
data.aws_iam_role.labrole: Reading...
data.aws_vpc.vpc: Reading...
data.aws_db_instance.tc_pg_db: Reading...
data.aws_security_group.rds_sg: Reading...
data.aws_iam_role.labrole: Read complete after 0s [id=LabRole]
data.aws_db_instance.tc_pg_db: Read complete after 0s [id=tc-pg-db]
data.archive_file.zip_the_python_code: Read complete after 0s [id=d3a12e18d7a3911d62772bff35be82b4e62eb162]
data.aws_security_group.rds_sg: Read complete after 0s [id=sg-02de4ddb6d89f1730]
data.aws_vpc.vpc: Read complete after 0s [id=vpc-01a81d790ce674a4c]
data.aws_subnets.subnets: Reading...
data.aws_subnets.subnets: Read complete after 0s [id=us-east-1]
data.aws_subnet.subnet["subnet-0c46fb968ff90f792"]: Reading...
data.aws_subnet.subnet["subnet-06345c13c20b7c9ae"]: Reading...
data.aws_subnet.subnet["subnet-047b1bbff831ba7cb"]: Reading...
data.aws_subnet.subnet["subnet-0c9fefacbcd198b0b"]: Reading...
data.aws_subnet.subnet["subnet-0c46fb968ff90f792"]: Read complete after 0s [id=subnet-0c46fb968ff90f792]
data.aws_subnet.subnet["subnet-047b1bbff831ba7cb"]: Read complete after 0s [id=subnet-047b1bbff831ba7cb]
data.aws_subnet.subnet["subnet-06345c13c20b7c9ae"]: Read complete after 0s [id=subnet-06345c13c20b7c9ae]
data.aws_subnet.subnet["subnet-0c9fefacbcd198b0b"]: Read complete after 0s [id=subnet-0c9fefacbcd198b0b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.every_15_minutes will be created
  + resource "aws_cloudwatch_event_rule" "every_15_minutes" {
      + arn                 = (known after apply)
      + description         = "trigger lambda every 15 minute"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "every_15_minutes_rule"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(15 minutes)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_target.lambda_target will be created
  + resource "aws_cloudwatch_event_target" "lambda_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "every_15_minutes_rule"
      + target_id      = "SendToLambda"
    }

  # aws_lambda_function.terraform_lambda_func will be created
  + resource "aws_lambda_function" "terraform_lambda_func" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./lambda/remover-pedidos.zip"
      + function_name                  = "RemoverPedidos"
      + handler                        = "remover_pedidos.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::533267423197:role/LabRole"
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "GuU4Qip0wGirTUnc2SRqU1lpNZTl1+YJIhCZHhvQGr4="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DB_HOST"     = "tc-pg-db.cba6ieokktwf.us-east-1.rds.amazonaws.com"
              + "DB_NAME"     = "lanchonetedobairro"
              + "DB_PASSWORD" = "Posgraduation109283"
              + "DB_USER"     = "tc3user"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-02de4ddb6d89f1730",
            ]
          + subnet_ids                  = [
              + "subnet-047b1bbff831ba7cb",
              + "subnet-06345c13c20b7c9ae",
              + "subnet-0c46fb968ff90f792",
              + "subnet-0c9fefacbcd198b0b",
            ]
          + vpc_id                      = (known after apply)
        }
    }

  # aws_lambda_permission.allow_eventbridge will be created
  + resource "aws_lambda_permission" "allow_eventbridge" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "RemoverPedidos"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge"
      + statement_id_prefix = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @BrunaPisera, Action: `pull_request`*